Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Hibernate ORM is the de facto standard JPA implementation and is well-known in the Java ecosystem. Hibernate ORM with Panache offers a new layer atop this familiar framework. This guide will not dive in to the specifics of either as those are already covered in the xref:hibernate-orm-panache.adoc[Hibernate ORM with Panache guide]. In this guide, we'll cover the Kotlin specific changes needed to use Hibernate ORM with Panache in your Kotlin-based Quarkus applications.
ja_jp: Hibernate ORMはデファクトスタンダードなJPA実装であり、Javaエコシステムではよく知られています。Hibernate ORM with Panacheはこのお馴染みのフレームワークの上に新しいレイヤーを提供します。これらの詳細については link:hibernate-orm-panache[Hibernate ORM with Panacheのガイド] ですでに説明しているので、このガイドでは触れません。このガイドでは、KotlinベースのQuarkusアプリケーションでHibernate ORM with Panacheを使用するために必要なKotlin固有の変更点について説明します。

source: Hibernate ORM is the de facto standard JPA implementation and offers you the full breadth of an Object Relational Mapper. It works beautifully in Quarkus.
ja_jp: Hibernate ORMは、デファクトスタンダートなJPA実装であり、オブジェクトリレーショナルマッパーの全幅を提供します。これはQuarkusで美しく動作します。

source: Hibernate ORM is the de facto standard Jakarta Persistence (formerly known as JPA) implementation and is well-known in the Java ecosystem. Hibernate ORM with Panache offers a new layer atop this familiar framework. This guide will not dive in to the specifics of either as those are already covered in the xref:hibernate-orm-panache.adoc[Hibernate ORM with Panache guide]. In this guide, we'll cover the Kotlin specific changes needed to use Hibernate ORM with Panache in your Kotlin-based Quarkus applications.
ja_jp: Hibernate ORMは、デファクトスタンダードであるJakarta Persistence（旧称JPA）実装であり、Javaエコシステムでよく知られています。Hibernate ORM with Panacheは、このおなじみのフレームワークの上に、新しいレイヤーを提供します。このガイドでは、 xref:hibernate-orm-panache.adoc[Hibernate ORM with Panacheのガイド] ですでにカバーされているため、どちらの仕様にも深入りしません。このガイドでは、KotlinベースのQuarkusアプリケーションでHibernate ORM with Panacheを使用するために必要なKotlin固有の変更点を説明します。

source: Hibernate ORM is the de facto standard Jakarta Persistence (formerly known as JPA) implementation and offers you the full breadth of an Object Relational Mapper. It works beautifully in Quarkus.
ja_jp: Hibernate ORMは、Jakarta Persistence（旧称JPA）のデファクトスタンダード実装であり、Object Relational Mapperの完全な実装を提供します。 Quarkusで見事に機能します。

source: Hibernate ORM maps property names using a physical naming strategy and an implicit naming strategy. If you wish to use Spring Boot's default naming strategies, the following properties need to be set:
ja_jp: Hibernate ORM は、物理的な命名戦略と暗黙的な命名戦略を使用してプロパティー名をマップします。Spring Boot のデフォルトの命名戦略を使用する場合は、次のプロパティーを設定する必要があります。

source: Hibernate ORM trying to load non-existing `package-info`
ja_jp: 存在しない `package-info` をロードしようとする Hibernate ORM

source: Hibernate ORM will execute these queries on application startup.
ja_jp: Hibernate ORMは、アプリケーションの起動時にこれらのクエリを実行します。

source: Hibernate ORM will use this constructor. When the query has a select clause, it is possible to have multiple constructors.
ja_jp: Hibernate ORM は、このコンストラクタを使用します。クエリが select 節を持つ場合、複数のコンストラクタを持てます。

source: Hibernate ORM with Panache in Quarkus relies on compile-time bytecode enhancements to your entities. If you define your entities in the same project where you build your Quarkus application, everything will work fine.
ja_jp: QuarkusのHibernate ORM with Panacheは、エンティティのコンパイル時のバイトコード拡張に依存しています。Quarkusアプリケーションをビルドするのと同じプロジェクトでエンティティを定義すれば、すべて問題なく動作します。

source: Hibernate ORM with Panache relies on compile-time bytecode enhancements to your entities.
ja_jp: Hibernate ORM with Panacheは、コンパイル時のエンティティーに対するバイトコード強化に依存しています。

source: Hibernate ORM's capability to integrate with JACC is disabled when building GraalVM native images, as JACC is not available - nor useful - in native mode.
ja_jp: GraalVMのネイティブイメージを構築する際には、JACCと統合するHibernate ORMの機能は無効になります。なぜなら、JACCはネイティブ・モードでは利用できず、有用でもないからです。

source: Hibernate Reactive API configuration properties
ja_jp: Hibernate Reactive API の設定プロパティー

source: Hibernate Reactive Panache uses `io.quarkus.hibernate.reactive.panache.PanacheEntity` instead of `io.quarkus.hibernate.orm.panache.PanacheEntity`. For more information, see link:{quickstarts-tree-url}/security-jpa-reactive-quickstart/src/main/java/org/acme/elytron/security/jpa/reactive/User.java[User file].
ja_jp: Hibernate Reactive Panache は、 `io.quarkus.hibernate.orm.panache.PanacheEntity` ではなく `io.quarkus.hibernate.reactive.panache.PanacheEntity` を使用します。 詳細は、link:{quickstarts-tree-url}/security-jpa-reactive-quickstart/src/main/java/org/acme/elytron/security/jpa/reactive/User.java[ユーザーファイル] を参照してください。

source: Hibernate Reactive REST Data with Panache extension (`quarkus-hibernate-reactive-rest-data-panache`)
ja_jp: Hibernate ORM REST Data with Panache エクステンション ( `quarkus-hibernate-orm-rest-data-panache` )

source: Hibernate Reactive `Session` and `Panache` APIs require an active CDI Request context. `@ActivateRequestContext` annotation creates a new request context and destroys it when the `Uni` returned from the method completes. If `Panache` is not used, `Mutiny.SessionFactory` can be injected and used similarly without the need of activating the request context or closing the session manually.
ja_jp: Hibernate Reactive `Session` および `Panache` API は、アクティブな CDI リクエストコンテキストを必要とします。 `@ActivateRequestContext` アノテーションは新しいリクエストコンテキストを作成し、メソッドから返された `Uni` が完了すると、それを破棄します。 `Panache` を使用しない場合は、 `Mutiny.SessionFactory` を注入して同様に使用することができ、 リクエストコンテキストをアクティブにしたりセッションを手動で閉じたりする必要はありません。

source: Hibernate Reactive batches changes you make to your entities and sends changes (it is called flush) at the end of the transaction or before a query. This is usually a good thing as it is more efficient. But if you want to check optimistic locking failures, do object validation right away or generally want to get immediate feedback, you can force the flush operation by calling `entity.flush()` or even use `entity.persistAndFlush()` to make it a single method call. This will allow you to catch any `PersistenceException` that could occur when Hibernate Reactive send those changes to the database. Remember, this is less efficient so don't abuse it. And your transaction still has to be committed.
ja_jp: Hibernate Reactive は、エンティティーに加えられた変更をバッチ処理し、トランザクションの終了時またはクエリーの前に変更を送信します (これはフラッシュと呼ばれます)。 これは通常、より効率的であるため良いことです。 しかし、楽観的なロックの失敗をチェックしたり、オブジェクト検証をすぐに実行したり、一般的に即時のフィードバックを取得する場合は、 `entity.flush()` を呼び出してフラッシュ操作を強制したり、 `entity.persistAndFlush()` を使用して単一のメソッド呼び出しにすることができます。これにより、Hibernate Reactive がデータベースに変更を送信したときに発生する可能性のある `PersistenceException` をキャッチできます。 ただし、これは効率が悪いので乱用しないでください。 また、トランザクションは依然としてコミットされる必要があります。

source: Hibernate Reactive can be used in the same application as Flyway. See xref:flyway.adoc#reactive-datasources[this section of the Flyway extension documentation] for details regarding configuration of Flyway in a reactive application.
ja_jp: Hibernate Reactive は Flyway と同じアプリケーションで使用できます。 リアクティブアプリケーションでの Flyway の設定に関する詳細は、 xref:flyway.adoc#reactive-datasources[Flyway エクステンションドキュメントのこのセクション] を参照してください。

source: Hibernate Reactive configuration properties
ja_jp: Hibernate Reactiveの設定プロパティ

source: Hibernate Reactive has been upgraded to version 2.0 to be compatible with Hibernate ORM 6.
ja_jp: Hibernate Reactiveは、Hibernate ORM 6に対応するため、バージョン2.0にアップグレードされました。

source: Hibernate Reactive in Quarkus currently does not support multiple persistence units.
ja_jp: QuarkusのHibernate Reactiveは現時点では複数の永続化ユニットをサポートしていません。

source: Hibernate Reactive is a reactive API for Hibernate ORM, supporting non-blocking database drivers and a reactive style of interaction with the database.
ja_jp: Hibernate Reactiveは、Hibernate ORMのリアクティブAPIで、ノンブロッキングデータベースドライバとデータベースとのリアクティブスタイルのインタラクションをサポートしています。

source: Hibernate Reactive is not a replacement for xref:hibernate-orm-panache.adoc[Hibernate ORM] or the future of Hibernate ORM. It is a different stack tailored for reactive use cases where you need high-concurrency.
ja_jp: Hibernate Reactive は、xref:hibernate-orm-panache.adoc[Hibernate ORM] を置き換えるものでも、次世代の Hibernate ORM でもありません。 これは、高い同時実行性が必要なリアクティブなユースケース向けに調整された別のスタックです。

source: Hibernate Reactive is not a replacement for xref:hibernate-orm.adoc[Hibernate ORM] or the future of Hibernate ORM. It is a different stack tailored for reactive use cases where you need high-concurrency.
ja_jp: Hibernate Reactiveは、 xref:hibernate-orm.adoc[Hibernate ORM] の置き換えでも、Hibernate ORMの将来でもありません。これは、高い並行性が必要なリアクティブなユースケース向けに調整された別のスタックです。

source: Hibernate Reactive is not configurable via a `persistence.xml` file.
ja_jp: Hibernate Reactiveは、 `persistence.xml` ファイルで設定できません。

source: Hibernate Reactive uses the same properties you would use for Hibernate ORM. You will notice that some properties contain `jdbc` in the name but there is no JDBC in Hibernate Reactive, these are simply legacy property names.
ja_jp: Hibernate Reactive は、Hibernate ORM で使用するのと同じプロパティを使用します。一部のプロパティの名前に `jdbc` が含まれていますが、Hibernate Reactive には JDBC がないため、これらは単にレガシー プロパティ名です。

source: Hibernate Reactive uses the same properties you would use for Hibernate ORM. You will notice that some properties contain `jdbc` in the name but there is not JDBC in Hibernate Reactive, these are simply legacy property names.
ja_jp: Hibernate Reactiveでは、Hibernate ORMで使用するのと同じプロパティを使用します。いくつかのプロパティの名前に `jdbc` が含まれていることに気づくと思いますが、Hibernate Reactive には JDBC は存在せず、これらは単に従来のプロパティ名です。

source: Hibernate Reactive uses the same properties you would use for Hibernate ORM: see <<configuration-reference>>.
ja_jp: Hibernate Reactive は、Hibernate ORM で使用するのと同じプロパティーを使用します：<<configuration-reference>> を参照してください。

source: Hibernate Reactive will use this constructor. When the query has a select clause, it is possible to have multiple constructors.
ja_jp: Hibernate Reactive は、このコンストラクタを使用します。クエリが select 節を持つ場合、複数のコンストラクタを持つことが可能です。

source: Hibernate Reactive with Panache relies on compile-time bytecode enhancements to your entities.
ja_jp: Hibernate Reactive with Panacheは、コンパイル時のエンティティに対するバイトコード拡張に依存しています。

source: Hibernate Reactive with Panache relies on compile-time bytecode enhancements to your entities. If you define your entities in the same project where you build your Quarkus application, everything will work fine.
ja_jp: Hibernate Reactive with Panache は、コンパイル時のバイトコード拡張によってエンティティーを拡張します。 Quarkus アプリケーションをビルドするのと同じプロジェクトでエンティティーを定義すれば、すべて正常に動作します。

source: Hibernate Reactive with Panache supports multiple persistence units. When using multiple persistence units, Panache automatically uses the correct persistence unit based on the entity's configuration.
ja_jp: Hibernate Reactive with Panache は、複数の永続化ユニットをサポートしています。複数の永続化ユニットを使用する場合、Panache はエンティティーの設定に基づいて正しい永続化ユニットを自動的に使用します。

source: Hibernate Reactive with Panache: provide active record and repository support on top of Hibernate Reactive.
ja_jp: Hibernate Reactive with Panache: Hibernate Reactiveの上でアクティブレコードとリポジトリのサポートを提供します。

source: Hibernate Reactive works with the same annotations and most of the configuration described in the xref:hibernate-orm.adoc[Hibernate ORM guide]. This guide will only focus on what's specific for Hibernate Reactive.
ja_jp: Hibernate Reactiveは、 xref:hibernate-orm.adoc[Hibernate ORMガイド] で説明されている同じアノテーションと、ほとんどの設定で動作します。このガイドでは、Hibernate Reactiveに特有のものにのみ焦点を当てます。

source: Hibernate Reactive works with the same annotations and most of the configuration described in the xref:quarkus-hibernate-orm.adoc[Hibernate ORM guide]. This guide will only focus on what's specific for Hibernate Reactive.
ja_jp: Hibernate Reactiveは、 link:quarkus-hibernate-orm.html[Hibernate ORMガイド]で説明されている同じアノテーションと、ほとんどの設定で動作します。このガイドでは、Hibernate Reactiveに特有のものにのみ焦点を当てます。

source: Hibernate Reactive: a version of Hibernate ORM using asynchronous and non-blocking clients to interact with the database.
ja_jp: Hibernate Reactive: Hibernate ORMの、非同期、ノンブロッキングのクライアントを使用してデータベースと対話するバージョンです。

source: Hibernate Search 6.1 also includes many smaller improvements, such as new search predicates or the ability to provide Elasticsearch index settings or mappings as JSON; see https://hibernate.org/search/releases/6.1/[the official Hibernate Search 6.1 webpage] for more details.
ja_jp: Hibernate Search 6.1には、新しい検索述語や、Elasticsearchのインデックス設定やマッピングをJSONで提供する機能など、細かい改良点も多数含まれています。詳細は、 link:https://hibernate.org/search/releases/6.1/[Hibernate Search 6.1の公式Webページ]をご覧ください。

source: Hibernate Search Configuration Reference
ja_jp: Hibernate Search 設定リファレンス

source: Hibernate Search Elasticsearch allows to synchronize your JPA entities to an Elasticsearch cluster and offers a way to query your Elasticsearch cluster using the Hibernate Search API.
ja_jp: Hibernate Search Elasticsearchでは、JPAエンティティーをElasticsearchクラスターに同期させることができ、Hibernate Search APIを使ってElasticsearchクラスターにクエリを発行する方法を提供しています。

source: Hibernate Search Elasticsearch allows to synchronize your Jakarta Persistence entities to an Elasticsearch cluster and offers a way to query your Elasticsearch cluster using the Hibernate Search API.
ja_jp: Hibernate Search Elasticsearchは、Jakarta PersistenceエンティティをElasticsearchクラスタに同期させ、Hibernate Search APIを使用してElasticsearchクラスタを照会する方法を提供します。

source: Hibernate Search Standalone allows you to index your entities in an Elasticsearch/OpenSearch cluster and easily offer full text search in all your applications, even without Hibernate ORM.
ja_jp: Hibernate Search Standaloneを使用すると、Elasticsearch/OpenSearchクラスタ内のエンティティにインデックスを付け、Hibernate ORMがなくても、すべてのアプリケーションで全文検索を簡単に提供できます。

source: Hibernate Search allows you to index your entities in an Elasticsearch cluster and easily offer full text search in all your Hibernate ORM-based applications.
ja_jp: Hibernate Searchは、Elasticsearchクラスタ内のエンティティをインデックス化し、Hibernate ORMベースのすべてのアプリケーションで簡単に全文検索を提供することができます。

source: Hibernate Search can now push entity change events to an outbox table in the database and coordinate between multiple instances of the application to process these events and reindex entities. This opt-in, **preview** feature allows for safer concurrent index updates with lower overhead on commit. Learn more in link:/guides/hibernate-search-orm-elasticsearch#coordination[this section of the guide].
ja_jp: Hibernate Search は、エンティティ変更イベントをデータベースの outbox テーブルにプッシュし、アプリケーションの複数のインスタンス間で調整してこれらのイベントを処理し、エンティティのインデックスを再作成できるようになりました。このオプトインの **プレビュー** 機能により、コミット時のオーバーヘッドを抑えた、より安全な同時インデックス更新が可能になります。詳しくは、 link:/guides/hibernate-search-orm-elasticsearch#coordination[このセクション] をご覧ください。

source: Hibernate Search guide
ja_jp: Hibernate Search ガイド

source: Hibernate Search is compatible with both https://www.elastic.co/elasticsearch[Elasticsearch] and https://www.opensearch.org/[OpenSearch], but it assumes it is working with an Elasticsearch cluster by default.
ja_jp: Hibernate Searchは link:https://www.elastic.co/elasticsearch[Elasticsearch]と link:https://www.opensearch.org/[OpenSearch]の両方に対応していますが、デフォルトではElasticsearchクラスタとの連携を前提としています。

source: Hibernate Search is now able to work with OpenSearch 1.0 to 1.2, with https://quarkus.io/guides/hibernate-search-orm-elasticsearch#opensearch[just a single change in your configuration properties].
ja_jp: Hibernate Searchは、 link:https://quarkus.io/guides/hibernate-search-orm-elasticsearch#opensearch[設定プロパティを1つ変更]するだけで、OpenSearch 1.0から1.2で動作するようになりました。

source: Hibernate Search is now tested to work up to and including Elasticsearch 7.16
ja_jp: Hibernate Searchは、Elasticsearch 7.16までの動作がテストされています。

source: Hibernate Search mostly behaves the same when using the `outbox-polling` coordination strategy as when not using it: application code (persisting entities, searching, etc.) should not require any change.
ja_jp: Hibernate Searchは、 `outbox-polling` 調整ストラテジーを使用してもしなくても、ほとんど同じ動作をします。アプリケーションコード（エンティティの永続化、検索など）を変更する必要はありません。

source: Hibernate Search now has a `@SearchExtension` annotation to be configured through annotated beans.
ja_jp: Hibernate Search に `@SearchExtension` アノテーションが追加され、アノテートされた Bean を通して設定できるようになりました。

source: Hibernate Search supports both a Lucene backend and an Elasticsearch backend.
ja_jp: Hibernate SearchはLuceneバックエンドとElasticsearchバックエンドの両方をサポートしています。

source: Hibernate Search with Hibernate ORM allows you to index your entities in an Elasticsearch/OpenSearch cluster and easily offer full text search in all your Hibernate ORM-based applications.
ja_jp: Hibernate ORMを使用したHibernate Searchでは、Elasticsearch/OpenSearchクラスタ内のエンティティにインデックスを付け、Hibernate ORMベースのすべてのアプリケーションでフルテキスト検索を簡単に提供できます。

source: Hibernate Search's management endpoint is considered preview.
ja_jp: Hibernate Search の管理エンドポイントは、プレビュー機能とされています。

source: Hibernate Validator - Allow customization of the ValidatorFactory
ja_jp: Hibernate Validator - ValidatorFactoryのカスタマイズを可能に

source: Hibernate Validator Configuration Reference
ja_jp: Hibernate Validator設定リファレンス

source: Hibernate Validator extension and CDI
ja_jp: Hibernate Validator エクステンションと CDI

source: Hibernate Validator integration into Hibernate ORM opens up the following capabilities:
ja_jp: Hibernate ORM への Hibernate Validator の統合により、以下の機能が利用可能になります。

source: Hibernate is the de facto Jakarta Persistence implementation and offers you the full breadth of an Object Relational Mapper.
ja_jp: Hibernate は、デファクトの Jakarta Persistence 実装であり、Object Relational Mapper の全機能を網羅しています。

source: Hibernate is very general-purpose, but does not make it trivial to do trivial operations that make up 90% of our model usage.
ja_jp: Hibernateは非常に汎用性が高いのですが、モデルの使用量の9割を占めるような些細な操作をしても些細にはなりません。

source: Hibernate multitenancy
ja_jp: Hibernate マルチテナンシー

source: Hibernate queries are super powerful, but overly verbose for common operations, requiring you to write queries even when you don't need all the parts.
ja_jp: Hibernateのクエリは非常に強力ですが、一般的な操作には冗長すぎるため、すべての部分が必要ない場合でもクエリを書く必要があります。

source: Hibernate will use **DTO projection** and generate a SELECT clause with the attributes from the projection class. This is also called **dynamic instantiation** or **constructor expression**, more info can be found on the Hibernate guide: link:https://docs.jboss.org/hibernate/orm/current/userguide/html_single/Hibernate_User_Guide.html#hql-select-clause[hql select clause]
ja_jp: Hibernateは **DTO射影(DTOプロジェクション)** を使って射影クラスの属性を持つSELECT句を生成できます。これは、 **動的インスタンス化** または **コンストラクタ式** とも呼ばれます。詳細はHibernateガイドの link:https://docs.jboss.org/hibernate/orm/current/userguide/html_single/Hibernate_User_Guide.html#hql-select-clause[hql select 句]を参照してください。

source: Hibernate will use **DTO projection** and generate a SELECT clause with the attributes from the projection class. This is also called **dynamic instantiation** or **constructor expression**, more info can be found on the Hibernate guide: link:{hibernate-orm-docs-url}#hql-select-clause[hql select clause]
ja_jp: Hibernateは *DTOプロジェクション* を使用し、プロジェクションクラスからの属性を持つSELECT句を生成します。これは *動的インスタンス化* または *コンストラクタ式* とも呼ばれ、詳細は Hibernate ガイドの link:{hibernate-orm-docs-url}#hql-select-clause[hql select 節] を参照してください。

source: Hibernate with Panache Next is the perfect solution if you want to get started using Hibernate in Quarkus.
ja_jp: Quarkus で Hibernate の使用を開始したい場合、Panache Next を使用した Hibernate は最適なソリューションです。

source: Hidden Fragment Definition in `item.html`
ja_jp: `item.html` における非表示フラグメントの定義

source: Hidden Fragments
ja_jp: 非表示 (hidden) フラグメント

source: Hidden Fragments (Capture)
ja_jp: 非表示（hidden）フラグメント（キャプチャ）

source: Hide secrets
ja_jp: シークレットを隠す

source: Hiding/Removing classes and resources from dependencies
ja_jp: クラスやリソースを依存関係から隠す/取り除く

source: High Throughput
ja_jp: 高いスループット

source: High concurrency and low resource usage
ja_jp: 高い同時実行性と低いリソース使用量

source: High concurrency without the headaches: the reactive core
ja_jp: 煩わしさのない高い並行処理: リアクティブコア

source: High quality
ja_jp: 高い品質

source: Highlighing misaligned versions
ja_jp: 整合性のないバージョンの強調表示

source: Highlighting in Editor: values are ignored
ja_jp: エディタでのハイライト：値が無視される

source: Highlighting misaligned versions
ja_jp: 揃っていないバージョンの強調表示

source: Histograms
ja_jp: ヒストグラム

source: Histograms and percentiles
ja_jp: ヒストグラムとパーセンタイル

source: Histograms are synchronous instruments used to measure a distribution of values over time. It is intended for statistics such as histograms, summaries, and percentile. The request duration and response payload size are good uses for a histogram.
ja_jp: ヒストグラムは、時間の経過に伴う値の分布を測定するために使用される同期計装です。 ヒストグラム、サマリー、パーセンタイルなどの統計を目的としています。 要求の継続時間と応答ペイロードサイズは、ヒストグラムでの使用に適しています。

source: Historically, it used to return a `GHUser` but, in newer versions, it returns a `GHMyself`, which broke the binary compatibility.
ja_jp: 歴史的に見ると、以前は `GHUser` を返していたが、新しいバージョンでは `GHMyself` を返すようになり、バイナリ互換性が壊れました。

source: Historically, the most common external language that used bean names was JSF. In Quarkus, we have xref:qute-reference.adoc#injecting-beans-directly-in-templates[Qute]. In a Qute template, one would refer to the bean using its name:
ja_jp: 歴史的に、Bean 名を使用していた最も一般的な外部言語は JSF でした。Quarkus では、xref:qute-reference.adoc#injecting-beans-directly-in-templates[Qute] があります。Qute テンプレートでは、Bean 名を使用して Bean を参照します。

source: Historically, you interacted with your Quarkus projects using Maven or Gradle commands. This will soon be over as Quarkus 2.0 introduces a brand new and improved Quarkus CLI.
ja_jp: これまでは、MavenやGradleのコマンドを使ってQuarkusプロジェクトを操作していました。しかし、それももうすぐ終わりです。Quarkus 2.0では新しく改良されたQuarkus CLIが導入されました。

source: Hit `CTRL+C` or type `q` to stop the application.
ja_jp: `CTRL+C` を押すか、 `q` と入力して、アプリケーションを停止してください。

source: Hit `CTRL+C` to stop the application, or keep it running and enjoy the blazing fast hot-reload.
ja_jp: `CTRL+C` を押してアプリケーションを停止することも、アプリケーションを起動したまま高速なホットリロードを行うことも可能です。

source: Hit `CTRL+C` to stop the application.
ja_jp: `CTRL+C` を叩いてアプリケーションを停止させます。

source: Hit refresh in your browser. The Quarkus development server will automatically detect the changes and recompile the app for you, so there's no need to restart it.
ja_jp: ブラウザの更新を実行します。Quarkusの開発サーバーが自動的に変更を検出してアプリを再コンパイルしてくれるので、再起動する必要はありません。

source: Hit refresh in your browser. The Quarkus development server will automatically detect the changes and recompile the app for you, so there’s no need to restart it.
ja_jp: ブラウザーで更新を押してください。Quarkus 開発サーバーは自動的に変更を検出し、アプリケーションを再コンパイルするので、再起動する必要はありません。

source: Hit refresh several times on `http://localhost:8080/coffee/2/recommendations`. The `TimeoutException` should not appear anymore. Instead, in case of a timeout, the page will display a single recommendation that we hardcoded in our fallback method `fallbackRecommendations()`, rather than two recommendations returned by the original method.
ja_jp: `http://localhost:8080/coffee/2/recommendations` を何回も更新してください。 `TimeoutException` はもう表示されないはずです。代わりに、タイムアウトが発生した場合、元のメソッドが返す2つのレコメンデーションではなく、フォールバックメソッド `fallbackRecommendations()` にハードコードされた1つのレコメンデーションが表示されます。

source: Hit refresh, this second request should again be successful and return a number.
ja_jp: リフレッシュすると、この2回目のリクエストが再び成功し、数字が返ってくるはずです。

source: Hm, wait a minute. What happens if multiple beans declare the same type?
ja_jp: ふむ、ちょっと待ってください。複数のBeanが同じ型を宣言した場合はどうなるのでしょうか?

source: Home
ja_jp: ホーム

source: Homebrew - for Linux and macOS
ja_jp: Homebrew - Linux および macOS 向け

source: Hope you like the refresh and see you in the Discussions!
ja_jp: リニューアルを気に入って頂けることを望んでいます。Discussionsで会いましょう!

source: Hopefully the categories are self-explanatory - intent is to have an initial set of categories as a starting place for discussions. We will add more categories as we get more feedback and see how users post.
ja_jp: うまくいけば、カテゴリーは自己記述的です - 意図したのは、議論の出発点となる初期のカテゴリーセットを用意することです。ご意見をいただいたり、ユーザーの皆様の投稿を拝見しながら、さらにカテゴリーを増やしていきたいと思います。
